README.org
#+CATEGORY: curro, villanueva, periodismodatos
#+TAGS: tabula, ocr, google. drive, scraping, kimono
#+DESCRIPTION: Herramientas de scraping de PDF y Web
#+AUTHOR: Adolfo Antón Bravo
#+EMAIL: adolflow@gmail.com
#+TITLE: Git, GitHub y Publicación Web
#+DATE: [2015-12-16 mié 16:00]

#+LATEX_HEADER: \usepackage[english]{babel}
#+LATEX_HEADER: \addto\captionsenglish{\renewcommand{\contentsname}{{\'I}ndice}}
#+LATEX_HEADER: \renewcommand{\contentsname}{Índice}
#+OPTIONS: ^:nil num:nil

#+OPTIONS: reveal_center:t reveal_progress:t reveal_history:nil reveal_control:t
#+OPTIONS: reveal_mathjax:t reveal_rolling_links:t reveal_keyboard:t reveal_overview:t num:nil
#+OPTIONS: reveal_width:1200 reveal_height:800
#+REVEAL_MARGIN: 0.1
#+REVEAL_MIN_SCALE: 0.5
#+REVEAL_MAX_SCALE: 2.5
#+REVEAL_TRANS: linear
#+REVEAL_THEME: sky
#+REVEAL_HLEVEL: 2
#+REVEAL_HEAD_PREAMBLE: <meta name="description" content="Herramientas de Scraping de PDF y Web.">
#+REVEAL_POSTAMBLE: <p> Creado por adolflow. </p>
#+REVEAL_PLUGINS: (highlight notes)
#+REVEAL_EXTRA_CSS: file:///home/flow/Documentos/software/reveal.js/css/reveal.css
#+REVEAL_ROOT: file:///home/flow/Documentos/software/reveal.js/

#+LATEX_HEADER: \maketitle
#+LATEX_HEADER: \tableofcontents

Módulo de periodismo de datos de /github/ donde aprenderemos cosas directamente relacionadas:

- git
- gestión de proyectos
- crear copias de proyectos
- adaptar proyectos
- participar en proyectos.


Puedes trabajar con git desde herramientas gráficas o desde la línea de comandos.

En este caso vamos a trabajar con la línea de comandos, preferiblemente en GNU/Linux.

* Instalación de git
En GNU/Linux, tan solo hay que instalar =git-core=:
#+BEGIN_SRC sh
apt-get install git-core
#+END_SRC

En Mac se puede instalar el [[https://sourceforge.net/projects/git-osx-installer/][instalador gráfico de git]] y en Windows, [[https://git-for-windows.github.io/][git for Windows]].

#+BEGIN_QUOTE
Para usar git desde la terminal en Mac hay que activar las funciones de Xcode.
#+END_QUOTE

Si queremos disfrutar de una terminal potente, podríamos usar [[http://cygwin.com][Cygwin]] en Windows o la Terminal en  Mac.

Comprobamos que se ha instalado git con la opción =--version=

#+BEGIN_SRC sh
git --version
#+END_SRC

También tenemos los instaladores oficiales de [[http://www.git-scm.com][git]]:
- Mac, http://www.git-scm.com/download/mac
- Windows, http://www.git-scm.com/download/win

* GitHub

Crea una [[http://www.github.com][cuenta en GitHub]]

Si no te atreviste con el paso anterior, puedes usar estos programas de escritorio para Windows y Mac:

- Windows: http://windows.github.com y [[https://help.github.com/articles/set-up-git/#platform-windows][primeros pasos]]
- Mac OS X: http://mac.github.com y [[https://help.github.com/articles/set-up-git/#platform-mac][primeros pasos]]


* Llave SSH

#+BEGIN_QUOTE
Si no sabes qué es SSH, sáltate esto
#+END_QUOTE

Las claves SSH son una forma de identificar ordenadores de confianza sin comprometer contraseñas. Se peude generar unas claves SSH y añadir la clave pública de GitHub para que se produzca la conexión.

GitHub recomienda revisar regularmente la lista de claves SSH y revocar aquellas que no se usen, no se hayan usado o no se vayan a usar.

Puedes conectarte por ssh y activar la llave ssh para conectarte de forma autentificada automáticamente. Vayamos paso a paso.

** Comprobación de claves

Primero comprobamos que contamos con clave ssh en el equipo:

#+BEGIN_SRC sh
ls -la ~/.ssh
#+END_SRC

Si aparece un listado de claves, podremos saltarnos el siguiente paso. Si no, debemos generar unas claves.

** Generar claves ssh

Necesitas generar una clave ssh el equipo local desde el que te conectas:

#+BEGIN_SRC sh
ssh-keygen -t rsa -b 4096 -C "correo-electronico@dominio.com"
#+END_SRC

Lo cual crea una nueva clave ssh y utiliza el correo electrónico como etiqueta.

Si todo va bien, mostrará el mensaje de generación de la clave, pedirá dónde almacenarla y se puede añadir una contraseña:

#+BEGIN_EXAMPLE
Generating public/private rsa key pair.
Enter file in which to save the key (/home/usuarix/.ssh/id_rsa): 
Enter passphrase (empty for no passphrase): 
Enter same passphrase again: 
Your identification has been saved in /home/usuarix/.ssh/id_rsa.
Your public key has been saved in /home/usuarix/.ssh/id_rsa.pub.
The key fingerprint is:
(...)
#+END_EXAMPLE

=(...)= es donde aparece la clave.

Ahora que ya tenemos la clave, la pegamos en GitHub en las preferencias, en el apartado "SSH and GPG keys".

*** Copia de clave con método =pbcopy=
Para seleccionar la clave, podemos emplear el método MacOSX =pbcopy=, que podemos hackear en GNU/Linux con un /alias/ a partir de =xsel=:

#+BEGIN_SRC sh
alias pbcopy='xsel --clipboard --input'
alias pbpaste='xsel --clipboard --output'
#+END_SRC

De esta forma ya podemos utilizar =pbcopy=:

#+BEGIN_SRC sh
pbcopy < ~/.ssh/id_rsa.pub
#+END_SRC

Y pegamos en GitHub. A partir de ahí ya podremos conectarnos con GitHub de forma segura.

*** Copia de clave con =more= y copiar y pegar

Podemos hacerlo en dos pasos, mostrando la clave y copiándola con el ratón:

#+BEGIN_SRC sh
more ~/.ssh/id_rsa.pub
#+END_SRC

** Configuración local y comprobación

Ya está casi todo hecho. Ahora falta decirle a git que nos conectamos a GitHub de forma segura. Para ello, podemos comprobar que lo podemos hacer, y en el mismo paso aprobar la conexión:

#+BEGIN_SRC sh
ssh -T git@github.com
#+END_SRC

Nos pedirá la contraseña que hayamos puesto a la clave si lo hemos hecho, lo introducimos y listo. Si no, nos saldrá directamente el mensaje:

#+BEGIN_EXAMPLE
The authenticity of host 'github.com (192.30.252.1)' can't be established.
RSA key fingerprint is 16:27:ac:a5:76:28:2d:36:63:1b:56:4d:eb:df:a6:48.
Are you sure you want to continue connecting (yes/no)?
#+END_EXAMPLE

Nótese que 192.30.252.1 es una de las direcciones IP de GitHub, pero podría salir otra. Lo más importante es fijarse en el fingerprint.

Le decimos que sí y entonces GitHub nos responde:

#+BEGIN_EXAMPLE
Hi usuarix! You've successfully authenticated, but GitHub does not provide shell access.
#+END_EXAMPLE

Donde =usuarix= es nuestrx usuarix en GitHub. Ya está hecho.

Si nos apareciese el mensaje =access denied=, recomiendo seguir los pasos anteriores o [[https://help.github.com/articles/error-permission-denied-publickey][este artículo de GitHub]] para comprobar que lo hemos hecho bien.

* Configuración

La primera vez que usas Git te pedirá tu nombre de usuarix y dirección de correo. Lo podemos agregar con el comando =config=.

Añado el nombre de la cuenta, en este caso el nombre de usuarix en GitHub:

#+BEGIN_SRC sh
git config --global user.name "Nombre_de_Usuarix"

#+END_SRC
Añado la dirección de correo electrónico:
#+BEGIN_SRC sh
git config --global user.email "usuarix@dominio"
#+END_SRC

Si no queremos aplicar esta configuración a todo el sistema y solo a este repositorio porque manejamos más usuarixs de GitHub, por ejemplo, no pongáis la opción =--global=
* Crear un repositorio

** Opción GitHub al final

Podemos iniciar el proyecto git en un directorio cualquiera, ya creado, o bien crearlo en uno nuevo.

