README.md
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">Instalación de git</a></li>
<li><a href="#orgheadline2">GitHub</a></li>
<li><a href="#orgheadline8">Llave SSH</a>
<ul>
<li><a href="#orgheadline3">Comprobación de claves</a></li>
<li><a href="#orgheadline6">Generar claves ssh</a>
<ul>
<li><a href="#orgheadline4">Copia de clave con método <code>pbcopy</code></a></li>
<li><a href="#orgheadline5">Copia de clave con <code>more</code> y copiar y pegar</a></li>
</ul>
</li>
<li><a href="#orgheadline7">Configuración local y comprobación</a></li>
</ul>
</li>
<li><a href="#orgheadline9">Configuración</a></li>
<li><a href="#orgheadline16">Crear un repositorio</a>
<ul>
<li><a href="#orgheadline13">Opción GitHub al final</a>
<ul>
<li><a href="#orgheadline10">Nuevo repositorio en directorio nuevo</a></li>
<li><a href="#orgheadline11">Nuevo repositorio en directorio existente</a></li>
<li><a href="#orgheadline12">Pasarlo a GitHub</a></li>
</ul>
</li>
<li><a href="#orgheadline14">Opción GitHub</a></li>
<li><a href="#orgheadline15">Comprobaciones</a></li>
</ul>
</li>
<li><a href="#orgheadline17">Clonar un repositorio</a></li>
<li><a href="#orgheadline18">Estado del repositorio</a></li>
<li><a href="#orgheadline19">Información de cambios en el repositorio</a></li>
<li><a href="#orgheadline21">Añadir y modificar documentos</a>
<ul>
<li><a href="#orgheadline20">Añadir</a></li>
</ul>
</li>
<li><a href="#orgheadline27">Renombrar archivos o directorios</a>
<ul>
<li>
<ul>
<li><a href="#orgheadline22">Renombrar un archivo</a></li>
<li><a href="#orgheadline23">Renombrar un directorio</a></li>
<li><a href="#orgheadline24">Case sensitive</a></li>
<li><a href="#orgheadline25">Borrar del repositorio</a></li>
<li><a href="#orgheadline26">Borrar un directorio</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline28">Actualizar repositorio</a></li>
<li><a href="#orgheadline29">Pull request</a></li>
<li><a href="#orgheadline30">Borrar rama</a></li>
<li><a href="#orgheadline31">Mantener un repositorio forkeado actualizado</a></li>
<li><a href="#orgheadline34">Publicación web</a>
<ul>
<li><a href="#orgheadline32">Nombre del repositorio</a></li>
<li><a href="#orgheadline33">Rama gh-pages</a></li>
</ul>
</li>
<li><a href="#orgheadline37">Problemas</a>
<ul>
<li><a href="#orgheadline35">403 fatal: HTTP request failed</a></li>
<li><a href="#orgheadline36">git: error: src refspec master does not match any</a></li>
</ul>
</li>
<li><a href="#orgheadline38">Bibliografía</a></li>
</ul>
</div>
</div>

Módulo de periodismo de datos de *github* donde aprenderemos cosas directamente relacionadas:

-   git
-   gestión de proyectos
-   crear copias de proyectos
-   adaptar proyectos
-   participar en proyectos.

Puedes trabajar con git desde herramientas gráficas o desde la línea de comandos.

En este caso vamos a trabajar con la línea de comandos, preferiblemente en GNU/Linux.

# Instalación de git<a id="orgheadline1"></a>

En GNU/Linux, tan solo hay que instalar `git-core`:

    apt-get install git-core

En Mac se puede instalar el [instalador gráfico de git](https://sourceforge.net/projects/git-osx-installer/) y en Windows, [git for Windows](https://git-for-windows.github.io/).

> Para usar git desde la terminal en Mac hay que activar las funciones de Xcode.

Si queremos disfrutar de una terminal potente, podríamos usar [Cygwin](http://cygwin.com) en Windows o la Terminal en  Mac.

Comprobamos que se ha instalado git con la opción `--version`

    git --version

También tenemos los instaladores oficiales de [git](http://www.git-scm.com):

-   Mac, <http://www.git-scm.com/download/mac>
-   Windows, <http://www.git-scm.com/download/win>

# GitHub<a id="orgheadline2"></a>

Crea una [cuenta en GitHub](http://www.github.com)

Si no te atreviste con el paso anterior, puedes usar estos programas de escritorio para Windows y Mac:

-   Windows: <http://windows.github.com> y [primeros pasos](https://help.github.com/articles/set-up-git/#platform-windows)
-   Mac OS X: <http://mac.github.com> y [primeros pasos](https://help.github.com/articles/set-up-git/#platform-mac)

# Llave SSH<a id="orgheadline8"></a>

> Si no sabes qué es SSH, sáltate esto

Las claves SSH son una forma de identificar ordenadores de confianza sin comprometer contraseñas. Se peude generar unas claves SSH y añadir la clave pública de GitHub para que se produzca la conexión.

GitHub recomienda revisar regularmente la lista de claves SSH y revocar aquellas que no se usen, no se hayan usado o no se vayan a usar.

Puedes conectarte por ssh y activar la llave ssh para conectarte de forma autentificada automáticamente. Vayamos paso a paso.

## Comprobación de claves<a id="orgheadline3"></a>

Primero comprobamos que contamos con clave ssh en el equipo:

    ls -la ~/.ssh

Si aparece un listado de claves, podremos saltarnos el siguiente paso. Si no, debemos generar unas claves.

## Generar claves ssh<a id="orgheadline6"></a>

Necesitas generar una clave ssh el equipo local desde el que te conectas:

    ssh-keygen -t rsa -b 4096 -C "correo-electronico@dominio.com"

Lo cual crea una nueva clave ssh y utiliza el correo electrónico como etiqueta.

Si todo va bien, mostrará el mensaje de generación de la clave, pedirá dónde almacenarla y se puede añadir una contraseña:

    Generating public/private rsa key pair.
    Enter file in which to save the key (/home/usuarix/.ssh/id_rsa): 
    Enter passphrase (empty for no passphrase): 
    Enter same passphrase again: 
    Your identification has been saved in /home/usuarix/.ssh/id_rsa.
    Your public key has been saved in /home/usuarix/.ssh/id_rsa.pub.
    The key fingerprint is:
    (...)

`(...)` es donde aparece la clave.

Ahora que ya tenemos la clave, la pegamos en GitHub en las preferencias, en el apartado "SSH and GPG keys".

### Copia de clave con método `pbcopy`<a id="orgheadline4"></a>

Para seleccionar la clave, podemos emplear el método MacOSX `pbcopy`, que podemos hackear en GNU/Linux con un *alias* a partir de `xsel`:

    alias pbcopy='xsel --clipboard --input'
    alias pbpaste='xsel --clipboard --output'

De esta forma ya podemos utilizar `pbcopy`:

    pbcopy < ~/.ssh/id_rsa.pub

Y pegamos en GitHub. A partir de ahí ya podremos conectarnos con GitHub de forma segura.

### Copia de clave con `more` y copiar y pegar<a id="orgheadline5"></a>

Podemos hacerlo en dos pasos, mostrando la clave y copiándola con el ratón:

    more ~/.ssh/id_rsa.pub

## Configuración local y comprobación<a id="orgheadline7"></a>

Ya está casi todo hecho. Ahora falta decirle a git que nos conectamos a GitHub de forma segura. Para ello, podemos comprobar que lo podemos hacer, y en el mismo paso aprobar la conexión:

    ssh -T git@github.com

Nos pedirá la contraseña que hayamos puesto a la clave si lo hemos hecho, lo introducimos y listo. Si no, nos saldrá directamente el mensaje:

    The authenticity of host 'github.com (192.30.252.1)' can't be established.
    RSA key fingerprint is 16:27:ac:a5:76:28:2d:36:63:1b:56:4d:eb:df:a6:48.
    Are you sure you want to continue connecting (yes/no)?

Nótese que 192.30.252.1 es una de las direcciones IP de GitHub, pero podría salir otra. Lo más importante es fijarse en el fingerprint.

Le decimos que sí y entonces GitHub nos responde:

    Hi usuarix! You've successfully authenticated, but GitHub does not provide shell access.

Donde `usuarix` es nuestrx usuarix en GitHub. Ya está hecho.

Si nos apareciese el mensaje `access denied`, recomiendo seguir los pasos anteriores o [este artículo de GitHub](https://help.github.com/articles/error-permission-denied-publickey) para comprobar que lo hemos hecho bien.

# Configuración<a id="orgheadline9"></a>

La primera vez que usas Git te pedirá tu nombre de usuarix y dirección de correo. Lo podemos agregar con el comando `config`.

Añado el nombre de la cuenta, en este caso el nombre de usuarix en GitHub:

    git config --global user.name "Nombre_de_Usuarix"

Añado la dirección de correo electrónico:

    git config --global user.email "usuarix@dominio"

Si no queremos aplicar esta configuración a todo el sistema y solo a este repositorio porque manejamos más usuarixs de GitHub, por ejemplo, no pongáis la opción `--global`

# Crear un repositorio<a id="orgheadline16"></a>

## Opción GitHub al final<a id="orgheadline13"></a>

Podemos iniciar el proyecto git en un directorio cualquiera, ya creado, o bien crearlo en uno nuevo.
