README.md

### Nuevo repositorio en directorio nuevo<a id="orgheadline10"></a>

Si queremos crearlo en uno nuevo, iniciamos el repositorio con la opción `init` seguida del nombre del directorio:

    git init nombre_repo

### Nuevo repositorio en directorio existente<a id="orgheadline11"></a>

También podemos crear un directorio con `mkdir` y luego inicializar ese directorio solo con la opción `init`:

    mkdir nombre_directorio
    cd nombre_directorio
    git init

### Pasarlo a GitHub<a id="orgheadline12"></a>

Para que el repositorio o proyecto también esté en GitHub, vamos a Github y creamos un proyecto nuevo que llamamos con el nombre del directorio que hemos creado o del directorio que ya existía.

> No marques la opción *Initialize with README* y tampoco le asignes licencia, vamos a crear un repositorio vacío para que nos sea más fácil realizar el primer `push`.

Conectamos el directorio local donde nos encontramos con GitHub de la siguiente manera:

    git remote add origin https://github.com/tu_nombre_usuarix/primera-newsapp.git

Donde le decimos a `git` que añadimos un `.git` remoto en la URL de GitHub.

Hemos de crear al menos un archivo README.md donde puedes poner la información del proyecto:

    echo "# Otro proyecto ni más ni menos" >> README.md

Añadimos el archivo a git:

    git add README.md

Lo comiteamos:

    git commit -m "mi primer commit"

Y lo subimos a GitHub:

    git push -u origin master

## Opción GitHub<a id="orgheadline14"></a>

Primero creas un repositorio con un nombre en Github.

Github te sugiere varias formas de copiarlo en local, en el propio ordenador. Os recomiendo seguir estos pasos:

    echo "# Proyecto de ..." >> README.md
    git init
    git add README.md
    git commit -m "primer commit"
    git remote add origin https://github.com/tu_usuarix/nombre_proyecto.git
    git push -u origin master

## Comprobaciones<a id="orgheadline15"></a>

Comprobamos su estado con la opción `status`:

    git status

Si listamos el directorio, comproboremos que tenemos un directorio oculto llamado `.git`

    ls -la

Cuando quieras que el directorio deje de ser un repositorio git, tan solo hay que borrar este directorio oculto con `rm -rf`:

    rm -rf .git

Si en este caso podríamos saber el *status* de git, el mensaje nos avisaría diciendo que no se trata de un repositorio git.

# Clonar un repositorio<a id="orgheadline17"></a>

Vamos a cualquier proyecto de GitHub y copiamos la URL que aparece en la casilla de **HTTPS**. En este caso, vamos a clonar el proyecto Boilerplate de Paul Irish:

    git clone git://github.com/paulirish/html5-boilerplate.git

# Estado del repositorio<a id="orgheadline18"></a>

Podemos ver el estado del repositorio con la opción `log`

    git log

Que nos da toda esta información:

-   La lista de cada `commit`
-   El *hash* *SHA1* del *commit*, una cadena única de cada *commit*
-   La autoría
-   El mensaje que describía el cambio

# Información de cambios en el repositorio<a id="orgheadline19"></a>

Si queremos ver los cambios en esta versión, debemos utilizar la opción `diff`:

    git diff

# Añadir y modificar documentos<a id="orgheadline21"></a>

## Añadir<a id="orgheadline20"></a>

    git add ruta-nuevos-archivos
    git commit -m "comentario sobre cambios"
    git push -u origin rama

# Renombrar archivos o directorios<a id="orgheadline27"></a>

### Renombrar un archivo<a id="orgheadline22"></a>

    git mv archivo1 archivo2
    git add archivo2
    git push -u origin master

### Renombrar un directorio<a id="orgheadline23"></a>

    git mv directorio1 directorio2
    git add directorio2
    git push -u origin master

Ver los cambios que vamos a realizar con la opción `-n`, el atajo de `--dry-run`

    git mv -n nombre_directorio_antiguo nombre_directorio_nuevo

### Case sensitive<a id="orgheadline24"></a>

Renombrar en sistemas que no distinguen entre mayúsculas y minúsculas, puede dar un error cuando modifiquemos el nombre por caracteres en mayúsculas, por lo que tendríamos que hacer:

    git mv directorio1 tempname && git mv tempname Directorio2

Si nuestro sistema no es *case sensitive*, puede ocurrir que queramos tener dos ficheros que se llaman igual, pero uno emplea mayúsculas y otro minúsculas, y git no nos lo deje incluir.

Por ejemplo, si tenemos `TFM.html` y `tfm.html` en local, y añadimos a git uno de ellos, luego no podremos añadir el otro a no ser que configuremos nuestro git como *case sensitive*:

    git config core.ignorecase false

Ahora ya podremos hacer `git add` con éxito.

La solución viene de [Stackoverflow](http://stackoverflow.com/questions/17683458/how-do-i-commit-case-sensitive-only-filename-changes-in-git)

### Borrar del repositorio<a id="orgheadline25"></a>

Borrar un archivo del repositorio sin borrarlo del sistema de directorios local:

    git rm --cached archivo.org

### Borrar un directorio<a id="orgheadline26"></a>

Para borrar un directorio:

    git rm --cached -r directorio

# Actualizar repositorio<a id="orgheadline28"></a>

Si queremos actualizar el repositorio con los cambios que se hayan producido en él, lo haremos con la opción `pull`:

    git pull

# Pull request<a id="orgheadline29"></a>

Haremos un *pull request* cuando queramos contribuir con nuestros cambios -mejoras, corrección de errores, actualizaciones- a un repositorio que ya existe.

Por eso, lo primero que tenemos que hacer es crear una copia del proyecto:

    git clone ruta-proyecto.git

Luego creamos una rama donde hacer las modificaciones:

    git checkout -b nueva-rama

Al crearla nos movemos a esa rama. Podemos comprobarlo si tenemos el asterisco en la rama deseada:

    git branch

Si no estamos ahí, vamos con:

    git checkout nueva-rama

Luego hacemos las modificaciones que sean a nuestros archivos, las añadimos, las comiteamos y las subimos a la rama creada:

    git add ruta-nuevos-archivos
    git commit -m "comentario sobre cambios"
    git push -u origin nueva-rama

Comprobamos el estado de git con `git status`

    git status

Si todo está bien, vamos a nuestra copia del proyecto en Github y en la página del repo pondrá que hay una rama sobre la que hacer un *pull-request*, pinchamos y seguimos los pasos.

Si no hay discusión, si está todo bien, el administrador lo aprobará y entonces podremos borrar la rama. Nos movemos a master y desde ahí borramos en local y en el servidor:

    git checkout master
    git branch -d nueva-rama
    git push origin --delete nueva-rama

# Borrar rama<a id="orgheadline30"></a>

En local:

    git branch -d rama-local

Si no se borra así, con `-D`

    git branch -d rama-local

En remoto::

    git push origin --delete rama-remota

o también:

    git push origin :ramaremota

# Mantener un repositorio forkeado actualizado<a id="orgheadline31"></a>

Añades upstream como servidor remoto:

    git remote add upstream git://github.com/ORIGINAL-DEV-USERNAME/REPO-YOU-FORKED-FROM.git

Actualizas upstream

    git fetch upstream

Actualizas el fork del repositorio original con sus cambios:

    git pull upstream master

# Publicación web<a id="orgheadline34"></a>

Si el contenido del proyecto es HTML, podemos utilizar a GitHub como servidor web de nuestro contenido web, a través de la funcionalidad [Pages](http://pages.github.com/).

Se puede hacer de dos maneras:

## Nombre del repositorio<a id="orgheadline32"></a>

Si el nombre del repositorio sigue la estructura "nombre-de-usuarix.github.io", el proyecto que cuelgue de ahí se publicará automágicamente en <http://nombre-de-usuarix.github.io>
