README.org
** Rama gh-pages

Cualquier repositorio que tenga la rama =gh-pages= será publicado, y se verá su contenido web.

Por ejemplo, si tenemos un repositorio con nombre =mi-proyecto= que contiene una web y queremos publicarlo como página web, solo tenemos que crear una nueva rama =branch= de nuestro proyecto que llamaremos =gh-pages=:

#+BEGIN_SRC sh
git checkout -b gh-pages
#+END_SRC

Luego ponemos ahí todo el contenido de la rama =master=:

#+BEGIN_SRC sh
git merge master
#+END_SRC

Por último subimos a GitHub todo lo que tenemos en la nueva rama:

#+BEGIN_SRC sh
$ git push -u origin gh-pages

#+END_SRC

En unos minutos, GitHub lo habrá publicado en una URL del tipo http://nombre-de-usuarix.github.io/mi-proyecto

Si tu repositorio es solo una web, puedes optar por utilizar solo la rama =gh-pages= en vez de mantener las dos ramas. Para ello tienes que elegir en GitHub qué rama utilizas.

Si mantienes las dos, actualizar la web se puede convertir en algo tedioso si lo haces habitualmente.

Para facilitar la tarea, [[http://brettterpstra.com/2012/09/26/github-tip-easily-sync-your-master-to-github-pages/][brettterpstra.com recomienda una solución]], puedes editar =.git/config= y añadir estas líneas a =[remote "origin"]=:

#+BEGIN_SRC sh
push = +refs/heads/master:refs/heads/gh-pages
push = +refs/heads/master:refs/heads/master
#+END_SRC

Quedando así:

#+BEGIN_SRC sh
[remote "origin"]
	fetch = +refs/heads/*:refs/remotes/origin/*
	url = git@github.com:user/repo.git
	push = +refs/heads/master:refs/heads/gh-pages
	push = +refs/heads/master:refs/heads/master

#+END_SRC

De esta manera, cuando hagas git push lo harás en los dos repos.



* Problemas
** 403 fatal: HTTP request failed
 http://stackoverflow.com/questions/7438313/pushing-to-git-returning-error-code-403-fatal-http-request-failed
 #+BEGIN_SRC sh
 git remote set-url origin https://yourusername@github.com/user/repo.git

 #+END_SRC

** git: error: src refspec master does not match any
http://stackoverflow.com/questions/10568641/git-error-src-refspec-master-does-not-match-any
#+BEGIN_SRC sh
git remote rm origin
git remote set-url origin git@....
git push -u origin master
#+END_SRC

* Bibliografía
Algunos recursos:
- [[https://git-scm.com/book/es][Git, distributed is the new centralized]]
- http://alistapart.com/article/get-started-with-git
- http://progit.org/book/ch1-4.html
- [[http://ferblape.github.io/github.com-medialab-desigualdad][Qué es y cómo publicar nuestros proyectos en Github]]
