README.md

## Rama gh-pages<a id="orgheadline33"></a>

Cualquier repositorio que tenga la rama `gh-pages` será publicado, y se verá su contenido web.

Por ejemplo, si tenemos un repositorio con nombre `mi-proyecto` que contiene una web y queremos publicarlo como página web, solo tenemos que crear una nueva rama `branch` de nuestro proyecto que llamaremos `gh-pages`:

    git checkout -b gh-pages

Luego ponemos ahí todo el contenido de la rama `master`:

    git merge master

Por último subimos a GitHub todo lo que tenemos en la nueva rama:

    $ git push -u origin gh-pages

En unos minutos, GitHub lo habrá publicado en una URL del tipo <http://nombre-de-usuarix.github.io/mi-proyecto>

Si tu repositorio es solo una web, puedes optar por utilizar solo la rama `gh-pages` en vez de mantener las dos ramas. Para ello tienes que elegir en GitHub qué rama utilizas.

Si mantienes las dos, actualizar la web se puede convertir en algo tedioso si lo haces habitualmente.

Para facilitar la tarea, [brettterpstra.com recomienda una solución](http://brettterpstra.com/2012/09/26/github-tip-easily-sync-your-master-to-github-pages/), puedes editar `.git/config` y añadir estas líneas a `[remote "origin"]`:

    push = +refs/heads/master:refs/heads/gh-pages
    push = +refs/heads/master:refs/heads/master

Quedando así:

    [remote "origin"]
            fetch = +refs/heads/*:refs/remotes/origin/*
            url = git@github.com:user/repo.git
            push = +refs/heads/master:refs/heads/gh-pages
            push = +refs/heads/master:refs/heads/master

De esta manera, cuando hagas git push lo harás en los dos repos.

# Problemas<a id="orgheadline37"></a>

## 403 fatal: HTTP request failed<a id="orgheadline35"></a>

<http://stackoverflow.com/questions/7438313/pushing-to-git-returning-error-code-403-fatal-http-request-failed>

    git remote set-url origin https://yourusername@github.com/user/repo.git

## git: error: src refspec master does not match any<a id="orgheadline36"></a>

<http://stackoverflow.com/questions/10568641/git-error-src-refspec-master-does-not-match-any>

    git remote rm origin
    git remote set-url origin git@....
    git push -u origin master

# Bibliografía<a id="orgheadline38"></a>

Algunos recursos:

-   [Git, distributed is the new centralized](https://git-scm.com/book/es)
-   <http://alistapart.com/article/get-started-with-git>
-   <http://progit.org/book/ch1-4.html>
-   [Qué es y cómo publicar nuestros proyectos en Github](http://ferblape.github.io/github.com-medialab-desigualdad)